# AddOverride Method (ElementId, Double) (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
RebarContainerParameterManager..::..AddOverride Method (ElementId, Double)
RebarContainerParameterManager Class Example See Also
---
Adds an override for the given parameter as its value will be displayed for the Rebar Container element.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2016
# Syntax
C#
---
```text
public void AddOverride(
	ElementId paramId,
	double value
)
```

Visual Basic
---
```text
Public Sub AddOverride ( _
	paramId As ElementId, _
	value As Double _
)
```

Visual C++
---
```text
public:
void AddOverride(
	ElementId^ paramId,
	double value
)
```

# ### Parameters
paramId
    Type: Autodesk.Revit.DB..::..ElementId The id of the parameter
value
    Type: System..::..Double The override value of the parameter.
# Examples
CopyC#
```text
// Override the value for A and set the parameter to modifiable for the given rebar container
void ManageParameters(RebarContainer container)
{
    RebarContainerParameterManager paramManager = container.GetParametersManager();

    Parameter aParam = container.LookupParameter("A");
    if (aParam != null)
    {
        paramManager.AddOverride(aParam.Id, 0.4);
        paramManager.SetOverriddenParameterModifiable(aParam.Id);
    }
}
```

CopyVB.NET
```text
' Override the value for A and set the parameter to modifiable for the given rebar container
Private Sub ManageParameters(container As RebarContainer)
    Dim paramManager As RebarContainerParameterManager = container.GetParametersManager()

    Dim aParam As Parameter = container.LookupParameter("A")
    If aParam IsNot Nothing Then
        paramManager.AddOverride(aParam.Id, 0.4)
        paramManager.SetOverriddenParameterModifiable(aParam.Id)
    End If
End Sub
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | paramId is not the id of a parameter in the current document, or its value type is not double. -or- paramId is not a Rebar Container parameter |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | None of the following disciplines is enabled: Structural. |

# See Also
RebarContainerParameterManager Class
AddOverride Overload
Autodesk.Revit.DB.Structure Namespace